## Plan Result (Aks_sbox - DeployInfrastructure)




<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azapi_resource.managedCluster[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azapi_resource.managedCluster[0] will be created
  + resource "azapi_resource" "managedCluster" {
      + body                      = {
          + properties = {
              + aadProfile        = {
                  + adminGroupObjectIDs = [
                      + "a6ce5b32-e0a5-419e-ba5c-67863c975941",
                      + "45bbf62b-788e-45e6-b584-01f62cf2d22a",
                    ]
                  + clientAppID         = null
                  + enableAzureRBAC     = false
                  + managed             = true
                  + serverAppID         = null
                  + serverAppSecret     = null
                  + tenantID            = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
                }
              + addonProfiles     = {
                  + azureKeyvaultSecretsProvider = {
                      + config  = {
                          + enableSecretRotation = "true"
                          + rotationPollInterval = "5m"
                        }
                      + enabled = true
                    }
                }
              + agentPoolProfiles = [
                  + {
                      + availabilityZones = [
                          + "1",
                        ]
                      + count             = 2
                      + enableAutoScaling = true
                      + maxCount          = 4
                      + minCount          = 2
                      + mode              = "System"
                      + name              = "system"
                      + nodeTaints        = [
                          + "CriticalAddonsOnly=true:NoSchedule",
                        ]
                      + osDiskSizeGB      = 128
                      + osDiskType        = "Ephemeral"
                      + osType            = "Linux"
                      + tags              = {
                          + application  = "core"
                          + autoShutdown = "true"
                          + builtFrom    = "hmcts/aks-sds-deploy"
                          + businessArea = "Cross-Cutting"
                          + criticality  = "Low"
                          + environment  = "sandbox"
                          + expiresAfter = "3000-01-01"
                        }
                      + vmSize            = "Standard_D4ds_v5"
                      + vnetSubnetID      = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-network-rg/providers/Microsoft.Network/virtualNetworks/ss-sbox-vnet/subnets/aks-01"
                    },
                  + {
                      + availabilityZones = [
                          + "1",
                        ]
                      + count             = 2
                      + enableAutoScaling = true
                      + maxCount          = 4
                      + minCount          = 2
                      + mode              = "User"
                      + name              = "linux"
                      + nodeTaints        = null
                      + osDiskSizeGB      = 128
                      + osDiskType        = "Ephemeral"
                      + osType            = "Linux"
                      + tags              = {
                          + application  = "core"
                          + autoShutdown = "true"
                          + builtFrom    = "hmcts/aks-sds-deploy"
                          + businessArea = "Cross-Cutting"
                          + criticality  = "Low"
                          + environment  = "sandbox"
                          + expiresAfter = "3000-01-01"
                        }
                      + vmSize            = "Standard_D4ds_v5"
                      + vnetSubnetID      = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-network-rg/providers/Microsoft.Network/virtualNetworks/ss-sbox-vnet/subnets/aks-01"
                    },
                  + {
                      + availabilityZones = [
                          + "1",
                        ]
                      + count             = 0
                      + enableAutoScaling = true
                      + maxCount          = 10
                      + minCount          = 0
                      + mode              = "User"
                      + name              = "cronjob"
                      + nodeTaints        = [
                          + "dedicated=jobs:NoSchedule",
                        ]
                      + osDiskSizeGB      = 128
                      + osDiskType        = "Ephemeral"
                      + osType            = "Linux"
                      + tags              = {
                          + application  = "core"
                          + autoShutdown = "true"
                          + builtFrom    = "hmcts/aks-sds-deploy"
                          + businessArea = "Cross-Cutting"
                          + criticality  = "Low"
                          + environment  = "sandbox"
                          + expiresAfter = "3000-01-01"
                        }
                      + vmSize            = "Standard_D4ds_v5"
                      + vnetSubnetID      = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-network-rg/providers/Microsoft.Network/virtualNetworks/ss-sbox-vnet/subnets/aks-01"
                    },
                ]
              + autoScalerProfile = {
                  + balance-similar-node-groups           = "false"
                  + daemonset-eviction-for-empty-nodes    = false
                  + daemonset-eviction-for-occupied-nodes = true
                  + expander                              = "random"
                  + ignore-daemonsets-utilization         = false
                  + max-empty-bulk-delete                 = "10"
                  + max-graceful-termination-sec          = "600"
                  + max-node-provision-time               = "15m"
                  + max-total-unready-percentage          = "45"
                  + new-pod-scale-up-delay                = "0s"
                  + ok-total-unready-count                = "3"
                  + scale-down-delay-after-add            = "10m"
                  + scale-down-delay-after-delete         = "10s"
                  + scale-down-delay-after-failure        = "3m"
                  + scale-down-unneeded-time              = "10m"
                  + scale-down-unready-time               = "20m"
                  + scale-down-utilization-threshold      = "0.5"
                  + scan-interval                         = "10s"
                  + skip-nodes-with-local-storage         = "false"
                  + skip-nodes-with-system-pods           = "true"
                }
              + dnsPrefix         = "k8s-ss-sbox-aks"
              + kubernetesVersion = "1.30.3"
              + networkProfile    = {
                  + dnsServiceIP     = "10.0.0.10"
                  + loadBalancerSku  = "Standard"
                  + networkDataplane = "azure"
                  + networkPlugin    = "azure"
                  + outboundType     = "loadBalancer"
                  + serviceCidr      = "10.0.0.0/16"
                }
            }
          + sku        = {
              + name = "Automatic"
              + tier = "Standard"
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + location                  = "uksouth"
      + name                      = "ss-sbox-01-aks"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-01-rg"
      + removing_special_chars    = false
      + schema_validation_enabled = true
      + type                      = "Microsoft.ContainerService/managedClusters@2024-03-02-preview"

      + identity {
          + identity_ids = [
              + "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/genesis-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-sbox-mi",
            ]
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":643,"Program":"tfcmt","SHA1":"","Target":"Aks_sbox - DeployInfrastructure","Vars":{}} -->